Table of Contents
 Class OpeningRect
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Representation of rectangular opening in IDEA StatiCa Detail
[OpenModelClass(typeof(Opening))]
public class OpeningRect : Opening
Inheritance
object
OpenObject
OpenElementId
Opening
OpeningRect
Inherited Members
 Opening.Name
 Opening.GeomId
 Opening.MasterComponent
 Opening.MasterPoint
 Opening.InsertPoint
 Opening.Outline
 Opening.Position
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 OpeningRect()
Constructor
public OpeningRect()
Properties
 Height
Height of wall
public double Height { get; set; }
Property Value
double
 Width
Width of wall
public double Width { get; set; }
Property Value
double
 Edit this page